deploy/jmeter/ipie-registration-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!-- Registration load test: the one flow that crosses a service boundary.
     See README.md beside this file for prerequisites and the run command. -->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="iPIE registration (cross-service) load test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Registrations" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,5)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </ThreadGroup>
      <hashTree>

        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="JSON headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>


        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="1 Create registration" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(appHost,ipie-user-service)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(appPort,8080)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/registrations</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"mobileNumber":"${regMobile}","email":"${regEmail}","notificationChannels":["EMAIL"]}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Child of this sampler, NOT of the thread group: a PreProcessor at thread-group
               scope runs before EVERY sampler, so the identity would be regenerated before the
               MailHog lookup and the search would ask for an address that was never registered. -->
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Unique identity per iteration" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def uniq = "${System.nanoTime()}${ctx.getThreadNum()}".takeRight(9)
vars.put("regEmail", "lt${uniq}@ipie.gov.in")
vars.put("regMobile", "+91 9${uniq}")</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract registrationId" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">regId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.registrationId</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Created" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="201">201</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="2 Request email OTP" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(appHost,ipie-user-service)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(appPort,8080)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/registrations/${regId}/email-otp</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Accepted (429 here means the rate limit was not raised)" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="202">202</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- The mail is delivered asynchronously: the outbox relay polls every 5s (ipie.events.outbox.relay-interval-ms)
             before the event even reaches RabbitMQ and communication-service, so this wait must exceed that interval.
             message is not there the instant the OTP is requested. -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Wait for async delivery" enabled="true">
          <stringProp name="ConstantTimer.delay">${__P(mailWaitMs,9000)}</stringProp>
        </ConstantTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="3 Read OTP from MailHog" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(mailHost,mailhog)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(mailPort,8025)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v2/search</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="kind" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">kind</stringProp>
                <stringProp name="Argument.value">to</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="query" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.name">query</stringProp>
                <stringProp name="Argument.value">${regEmail}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Body arrives quoted-printable, so the code can be split by a soft line break. -->
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract OTP" enabled="true">
            <stringProp name="RegexExtractor.refname">otp</stringProp>
            <stringProp name="RegexExtractor.regex">code is:\s*([0-9]{6})</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">NO_OTP</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Strip soft line breaks" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">def raw = vars.get("otp") ?: ""
vars.put("otp", raw.replaceAll("[^0-9]", ""))</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="4 Confirm email OTP" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(appHost,ipie-user-service)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(appPort,8080)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/registrations/${regId}/email-otp/confirm</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"code":"${otp}"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Confirmed" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- THE SAMPLER THIS PLAN EXISTS FOR: completeRegistration calls iam-service through
             InterServiceClient, so this is where the Bulkhead (10 concurrent per target),
             RateLimiter, CircuitBreaker and Retry actually engage. A BulkheadFullException
             surfaces here as a 5xx, and that is the signal to watch as concurrency rises. -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="5 Complete registration (crosses into iam-service)" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(appHost,ipie-user-service)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(appPort,8080)}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/registrations/${regId}/complete</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"fullName":"Load Test User","password":"LoadTest@12345","category":"INDIAN"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Provisioned via iam-service" enabled="true">
            <collectionProp name="Asserion.test_strings"><stringProp name="200">200</stringProp></collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>